testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_1000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/2/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 63.19ms, 158.27 req/s, 150.99MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.54MB (10003820) total, 120B (120) headers (space savings 87.23%), 9.54MB (10000000) data
UDP datagram: 467 sent, 8242 received
                     min         max         mean         sd        +/- sd
time for request:    36.07ms     56.19ms     46.51ms      6.72ms    60.00%
time for connect:     4.03ms     25.39ms     14.55ms      7.18ms    60.00%
time to 1st byte:    25.23ms     28.00ms     26.48ms      1.06ms    60.00%
req/s           :      16.06       16.90       16.36        0.29    80.00%